app/controllers/sessions_controller.rb

  def create
    session = Session.new
    user = User.find_by(email: params[:session][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]