app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "qaz741qhn@gmail.com"], ["password", "foobar"], ["created_at", "2021-08-26 08:28:15.457794"], ["updated_at", "2021-08-26 08:28:15.457794"]]